recipes/mac-n-cheese.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegan Mac 'n' Cheese</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Vegan Mac 'n' Cheese</h1>
<p>
<a href="https://www.jamieoliver.com/recipes/pasta-recipes/vegan-mac-n-cheese/">Original link</a>
</p>

<div id="outline-container-org8cc5f7c" class="outline-2">
<h2 id="org8cc5f7c">Ingredients</h2>
<div class="outline-text-2" id="text-org8cc5f7c">
<ul class="org-ul">
<li>350 g dried macaroni</li>
<li>sea salt</li>
<li>freshly ground black pepper</li>
<li>1 onion</li>
<li>1 litre unsweetened plamp milk</li>
<li>100 g dairy-free margarine</li>
<li>85 g plain flour</li>
<li>1 heaped teaspoon Dijon mustard</li>
<li>1 1/2 tablespoons nutritional yeast flakes</li>
<li>50 g vegan cheese, optional (available from specialist stores)</li>
<li>5 cloves of garlic</li>
<li>1/2 a bunch of fresh thyme</li>
<li>olive oil</li>
<li>40 g fresh breadcrumbs</li>
</ul>
</div>
</div>

<div id="outline-container-org5955b8f" class="outline-2">
<h2 id="org5955b8f">Method</h2>
<div class="outline-text-2" id="text-org5955b8f">
<ol class="org-ol">
<li>Preheat the oven to 180&deg;C. Cook the macaroni according to the packet instructions in a large pan of salted boiling water.</li>
<li>Meanwhile, peel and halve the onion, then place in a small pan over a medium heat with the milk. Slowly bring to the boil, then remove from the heat. Pick out and discard the onion, then set aside. Melt the margarine in another pan over a medium heat, then add the flour, stirring continuously until it forms a paste – this is the roux. Gradually add the warm milk a little at a time, whisking continuously until smooth. Bring to the boil, then simmer for around 10 minutes, or until thickened. Stir in the mustard and nutritional yeast flakes, grate and stir in the vegan cheese (if using), then season to taste with salt and pepper.</li>
<li>Drain and add the macaroni to the sauce, then toss to coat. Transfer the mixture to an ovenproof baking dish (roughly 20cm x 30cm), then set aside.</li>
<li>Peel and finely slice the garlic, then pick the thyme leaves, discarding the stalks. Add to a medium pan over a medium heat with a splash of oil. Cook for 2 to 3 minutes, or until golden, then transfer to a food processor with the breadcrumbs and a splash of oil. Blitz until combined and roughly chopped, then sprinkle over the pasta. Place the dish in the hot oven for 20 to 25 minutes, or until golden and bubbling. Leave to stand for around 5 minutes, then serve with seasonal greens.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
